---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.GetEnumerator
source: html/59832e0d-60d1-ecac-3277-1015cb14fdf4.htm
---
# Autodesk.Revit.DB.ExportLayerTable.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.